; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=306, out_folder=htg/blocksworld/training, instance_id=62, seed=2086, goal_proportion=0.03

(define (problem blocksworld-62)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 - object)
 (:init 
    (arm-empty)
    (clear b90)
    (on b90 b260)
    (on b260 b135)
    (on b135 b189)
    (on-table b189)
    (clear b33)
    (on-table b33)
    (clear b148)
    (on b148 b39)
    (on b39 b227)
    (on b227 b115)
    (on b115 b200)
    (on b200 b20)
    (on b20 b86)
    (on b86 b157)
    (on b157 b4)
    (on b4 b219)
    (on b219 b49)
    (on b49 b302)
    (on-table b302)
    (clear b52)
    (on-table b52)
    (clear b56)
    (on b56 b270)
    (on-table b270)
    (clear b187)
    (on b187 b256)
    (on b256 b264)
    (on-table b264)
    (clear b74)
    (on b74 b305)
    (on-table b305)
    (clear b195)
    (on b195 b89)
    (on b89 b179)
    (on b179 b204)
    (on b204 b134)
    (on b134 b275)
    (on b275 b36)
    (on b36 b72)
    (on b72 b51)
    (on b51 b96)
    (on-table b96)
    (clear b111)
    (on b111 b104)
    (on b104 b6)
    (on b6 b205)
    (on b205 b190)
    (on-table b190)
    (clear b217)
    (on-table b217)
    (clear b228)
    (on b228 b78)
    (on b78 b207)
    (on b207 b223)
    (on b223 b188)
    (on b188 b125)
    (on-table b125)
    (clear b285)
    (on b285 b274)
    (on b274 b186)
    (on b186 b292)
    (on b292 b298)
    (on b298 b278)
    (on b278 b124)
    (on b124 b255)
    (on b255 b136)
    (on b136 b109)
    (on-table b109)
    (clear b281)
    (on b281 b181)
    (on b181 b151)
    (on-table b151)
    (clear b46)
    (on-table b46)
    (clear b211)
    (on b211 b160)
    (on b160 b249)
    (on-table b249)
    (clear b41)
    (on-table b41)
    (clear b101)
    (on b101 b171)
    (on-table b171)
    (clear b210)
    (on b210 b301)
    (on-table b301)
    (clear b254)
    (on b254 b146)
    (on b146 b48)
    (on b48 b25)
    (on b25 b215)
    (on b215 b158)
    (on-table b158)
    (clear b66)
    (on b66 b43)
    (on b43 b55)
    (on-table b55)
    (clear b287)
    (on b287 b282)
    (on b282 b143)
    (on b143 b221)
    (on-table b221)
    (clear b178)
    (on b178 b3)
    (on b3 b222)
    (on b222 b117)
    (on-table b117)
    (clear b107)
    (on-table b107)
    (clear b60)
    (on b60 b230)
    (on b230 b168)
    (on-table b168)
    (clear b152)
    (on b152 b235)
    (on-table b235)
    (clear b291)
    (on b291 b2)
    (on b2 b283)
    (on b283 b82)
    (on b82 b19)
    (on b19 b10)
    (on-table b10)
    (clear b141)
    (on b141 b175)
    (on b175 b83)
    (on-table b83)
    (clear b303)
    (on b303 b27)
    (on b27 b267)
    (on b267 b236)
    (on-table b236)
    (clear b1)
    (on b1 b62)
    (on b62 b269)
    (on b269 b159)
    (on b159 b245)
    (on b245 b248)
    (on b248 b273)
    (on-table b273)
    (clear b102)
    (on b102 b268)
    (on b268 b50)
    (on-table b50)
    (clear b149)
    (on b149 b266)
    (on-table b266)
    (clear b271)
    (on b271 b14)
    (on-table b14)
    (clear b155)
    (on b155 b290)
    (on b290 b54)
    (on b54 b30)
    (on b30 b100)
    (on-table b100)
    (clear b306)
    (on b306 b246)
    (on b246 b92)
    (on b92 b208)
    (on b208 b191)
    (on-table b191)
    (clear b75)
    (on b75 b71)
    (on-table b71)
    (clear b59)
    (on-table b59)
    (clear b163)
    (on b163 b120)
    (on-table b120)
    (clear b161)
    (on b161 b9)
    (on b9 b193)
    (on-table b193)
    (clear b232)
    (on b232 b85)
    (on-table b85)
    (clear b144)
    (on b144 b169)
    (on b169 b18)
    (on b18 b277)
    (on b277 b272)
    (on b272 b261)
    (on b261 b250)
    (on b250 b45)
    (on b45 b164)
    (on b164 b213)
    (on b213 b174)
    (on b174 b12)
    (on b12 b240)
    (on b240 b288)
    (on b288 b110)
    (on-table b110)
    (clear b280)
    (on b280 b224)
    (on b224 b162)
    (on-table b162)
    (clear b130)
    (on b130 b284)
    (on-table b284)
    (clear b147)
    (on b147 b26)
    (on b26 b216)
    (on b216 b253)
    (on b253 b73)
    (on b73 b237)
    (on-table b237)
    (clear b28)
    (on b28 b133)
    (on b133 b202)
    (on b202 b64)
    (on b64 b65)
    (on b65 b139)
    (on-table b139)
    (clear b153)
    (on b153 b44)
    (on b44 b122)
    (on b122 b35)
    (on b35 b182)
    (on b182 b198)
    (on-table b198)
    (clear b241)
    (on b241 b126)
    (on b126 b242)
    (on b242 b84)
    (on b84 b145)
    (on b145 b131)
    (on b131 b289)
    (on b289 b108)
    (on b108 b226)
    (on b226 b99)
    (on b99 b212)
    (on b212 b132)
    (on-table b132)
    (clear b7)
    (on b7 b192)
    (on b192 b121)
    (on b121 b81)
    (on-table b81)
    (clear b233)
    (on-table b233)
    (clear b296)
    (on-table b296)
    (clear b294)
    (on b294 b165)
    (on-table b165)
    (clear b150)
    (on b150 b37)
    (on b37 b61)
    (on b61 b263)
    (on-table b263)
    (clear b17)
    (on b17 b127)
    (on b127 b87)
    (on b87 b293)
    (on b293 b69)
    (on b69 b300)
    (on b300 b47)
    (on b47 b79)
    (on b79 b77)
    (on-table b77)
    (clear b116)
    (on b116 b67)
    (on-table b67)
    (clear b258)
    (on b258 b8)
    (on-table b8)
    (clear b199)
    (on-table b199)
    (clear b173)
    (on b173 b129)
    (on b129 b97)
    (on b97 b183)
    (on b183 b29)
    (on b29 b244)
    (on b244 b295)
    (on-table b295)
    (clear b119)
    (on b119 b276)
    (on b276 b128)
    (on b128 b156)
    (on b156 b91)
    (on b91 b53)
    (on-table b53)
    (clear b176)
    (on-table b176)
    (clear b63)
    (on b63 b23)
    (on b23 b214)
    (on b214 b238)
    (on-table b238)
    (clear b185)
    (on-table b185)
    (clear b88)
    (on b88 b80)
    (on b80 b265)
    (on-table b265)
    (clear b252)
    (on b252 b24)
    (on b24 b31)
    (on b31 b105)
    (on b105 b42)
    (on-table b42)
    (clear b123)
    (on-table b123)
    (clear b95)
    (on b95 b196)
    (on b196 b103)
    (on b103 b15)
    (on b15 b170)
    (on b170 b94)
    (on b94 b5)
    (on b5 b234)
    (on b234 b225)
    (on b225 b243)
    (on b243 b184)
    (on-table b184)
    (clear b32)
    (on b32 b154)
    (on-table b154)
    (clear b98)
    (on-table b98)
    (clear b13)
    (on b13 b22)
    (on b22 b137)
    (on b137 b297)
    (on b297 b206)
    (on b206 b197)
    (on b197 b112)
    (on b112 b57)
    (on b57 b262)
    (on b262 b16)
    (on b16 b209)
    (on-table b209)
    (clear b58)
    (on-table b58)
    (clear b138)
    (on b138 b172)
    (on b172 b231)
    (on b231 b201)
    (on b201 b203)
    (on b203 b286)
    (on b286 b194)
    (on b194 b68)
    (on b68 b247)
    (on b247 b180)
    (on b180 b142)
    (on b142 b113)
    (on b113 b239)
    (on-table b239)
    (clear b299)
    (on b299 b76)
    (on b76 b21)
    (on b21 b70)
    (on b70 b220)
    (on-table b220)
    (clear b177)
    (on b177 b11)
    (on b11 b118)
    (on b118 b218)
    (on b218 b167)
    (on-table b167)
    (clear b114)
    (on-table b114)
    (clear b251)
    (on b251 b259)
    (on-table b259)
    (clear b166)
    (on b166 b40)
    (on b40 b34)
    (on b34 b93)
    (on b93 b38)
    (on-table b38)
    (clear b257)
    (on b257 b229)
    (on b229 b279)
    (on b279 b106)
    (on b106 b304)
    (on-table b304)
    (clear b140)
    (on-table b140))
 (:goal  (and 
    (clear b8)
    (on b8 b7)
    (on b7 b3)
    (on b3 b1)
    (on b1 b9)
    (on b9 b4)
    (on b4 b2)
    (on b2 b6)
    (on b6 b5)
    (on-table b5))))

; plan
1. (unstack b111 b104)
   deleted: (on b111 b104) (clear b111) (arm-empty)
   added: (holding b111) (clear b104)
   goals met: 0 of 10
2. (putdown b111)
   deleted: (holding b111)
   added: (clear b111) (arm-empty) (on-table b111)
   goals met: 0 of 10
3. (unstack b104 b6)
   deleted: (on b104 b6) (clear b104) (arm-empty)
   added: (holding b104) (clear b6)
   goals met: 0 of 10
4. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 0 of 10
5. (unstack b148 b39)
   deleted: (on b148 b39) (clear b148) (arm-empty)
   added: (holding b148) (clear b39)
   goals met: 0 of 10
6. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 0 of 10
7. (unstack b161 b9)
   deleted: (on b161 b9) (clear b161) (arm-empty)
   added: (holding b161) (clear b9)
   goals met: 0 of 10
8. (putdown b161)
   deleted: (holding b161)
   added: (clear b161) (arm-empty) (on-table b161)
   goals met: 0 of 10
9. (unstack b178 b3)
   deleted: (on b178 b3) (clear b178) (arm-empty)
   added: (holding b178) (clear b3)
   goals met: 0 of 10
10. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 0 of 10
11. (unstack b258 b8)
   deleted: (on b258 b8) (clear b258) (arm-empty)
   added: (holding b258) (clear b8)
   goals met: 1 of 10
12. (putdown b258)
   deleted: (holding b258)
   added: (clear b258) (arm-empty) (on-table b258)
   goals met: 1 of 10
13. (unstack b291 b2)
   deleted: (on b291 b2) (clear b291) (arm-empty)
   added: (holding b291) (clear b2)
   goals met: 1 of 10
14. (putdown b291)
   deleted: (holding b291)
   added: (clear b291) (arm-empty) (on-table b291)
   goals met: 1 of 10
15. (unstack b39 b227)
   deleted: (on b39 b227) (clear b39) (arm-empty)
   added: (holding b39) (clear b227)
   goals met: 1 of 10
16. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 1 of 10
17. (unstack b227 b115)
   deleted: (on b227 b115) (clear b227) (arm-empty)
   added: (holding b227) (clear b115)
   goals met: 1 of 10
18. (putdown b227)
   deleted: (holding b227)
   added: (clear b227) (arm-empty) (on-table b227)
   goals met: 1 of 10
19. (unstack b115 b200)
   deleted: (on b115 b200) (clear b115) (arm-empty)
   added: (holding b115) (clear b200)
   goals met: 1 of 10
20. (putdown b115)
   deleted: (holding b115)
   added: (clear b115) (arm-empty) (on-table b115)
   goals met: 1 of 10
21. (unstack b200 b20)
   deleted: (on b200 b20) (clear b200) (arm-empty)
   added: (holding b200) (clear b20)
   goals met: 1 of 10
22. (putdown b200)
   deleted: (holding b200)
   added: (clear b200) (arm-empty) (on-table b200)
   goals met: 1 of 10
23. (unstack b20 b86)
   deleted: (on b20 b86) (clear b20) (arm-empty)
   added: (holding b20) (clear b86)
   goals met: 1 of 10
24. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 10
25. (unstack b86 b157)
   deleted: (on b86 b157) (clear b86) (arm-empty)
   added: (holding b86) (clear b157)
   goals met: 1 of 10
26. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 1 of 10
27. (unstack b157 b4)
   deleted: (on b157 b4) (clear b157) (arm-empty)
   added: (holding b157) (clear b4)
   goals met: 1 of 10
28. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 1 of 10
29. (unstack b95 b196)
   deleted: (on b95 b196) (clear b95) (arm-empty)
   added: (holding b95) (clear b196)
   goals met: 1 of 10
30. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 1 of 10
31. (unstack b196 b103)
   deleted: (on b196 b103) (clear b196) (arm-empty)
   added: (holding b196) (clear b103)
   goals met: 1 of 10
32. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 1 of 10
33. (unstack b103 b15)
   deleted: (on b103 b15) (clear b103) (arm-empty)
   added: (holding b103) (clear b15)
   goals met: 1 of 10
34. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 1 of 10
35. (unstack b15 b170)
   deleted: (on b15 b170) (clear b15) (arm-empty)
   added: (holding b15) (clear b170)
   goals met: 1 of 10
36. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 10
37. (unstack b170 b94)
   deleted: (on b170 b94) (clear b170) (arm-empty)
   added: (holding b170) (clear b94)
   goals met: 1 of 10
38. (putdown b170)
   deleted: (holding b170)
   added: (clear b170) (arm-empty) (on-table b170)
   goals met: 1 of 10
39. (unstack b94 b5)
   deleted: (on b94 b5) (clear b94) (arm-empty)
   added: (holding b94) (clear b5)
   goals met: 1 of 10
40. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 1 of 10
41. (unstack b5 b234)
   deleted: (on b5 b234) (clear b5) (arm-empty)
   added: (holding b5) (clear b234)
   goals met: 1 of 10
42. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 10
43. (unstack b6 b205)
   deleted: (on b6 b205) (clear b6) (arm-empty)
   added: (holding b6) (clear b205)
   goals met: 2 of 10
44. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 3 of 10
45. (unstack b2 b283)
   deleted: (on b2 b283) (clear b2) (arm-empty)
   added: (holding b2) (clear b283)
   goals met: 3 of 10
46. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 4 of 10
47. (unstack b3 b222)
   deleted: (on b3 b222) (clear b3) (arm-empty)
   added: (holding b3) (clear b222)
   goals met: 4 of 10
48. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 5 of 10
49. (unstack b4 b219)
   deleted: (on b4 b219) (clear b4) (arm-empty)
   added: (holding b4) (clear b219)
   goals met: 5 of 10
50. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 6 of 10
51. (unstack b7 b192)
   deleted: (on b7 b192) (clear b7) (arm-empty)
   added: (holding b7) (clear b192)
   goals met: 6 of 10
52. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 7 of 10
53. (unstack b9 b193)
   deleted: (on b9 b193) (clear b9) (arm-empty)
   added: (holding b9) (clear b193)
   goals met: 7 of 10
54. (stack b9 b4)
   deleted: (clear b4) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b4)
   goals met: 8 of 10
55. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 7 of 10
56. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 7 of 10
57. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 6 of 10
58. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 10
59. (unstack b1 b62)
   deleted: (on b1 b62) (clear b1) (arm-empty)
   added: (holding b1) (clear b62)
   goals met: 6 of 10
60. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 7 of 10
61. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 7 of 10
62. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 8 of 10
63. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 8 of 10
64. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 9 of 10
65. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 8 of 10
66. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 10 of 10
